Project2/tdd/TravelAgencyCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.webservice.dk.dtu/">
  <soapenv:Body>
    <ser:getFlights>
      <!--Optional:-->
      <startDestination>dsgsdgds</startDestination>
      <!--Optional:-->
      <endDestination>sdgsdgs</endDestination>
      <!--Optional:-->
      <startDate>asfsaf</startDate>
    </ser:getFlights>
  </soapenv:Body>
</soapenv:Envelope>